/*
Задача 1.
Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.

Пример.
4	3	1	(1,2)	=>	9
2	6	9 

*/


/*
Задача 2: Задайте двумерный массив. Напишите
программу, которая поменяет местами первую и
последнюю строку массива.

Пример.
4	3	1	=>	4	6	2
2	6	9		2	6	9
4	6	2		4	3	1
*/


/*
Задача 3.
Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

Пример.
4	3	1	=>	Строка с индексом 0
2	6	9
4	6	2
*/


/*
Задача 4*(не обязательная).
Задайте двумерный массив из целых чисел. Напишите программу, которая удалит строку и столбец, на пересечении которых расположен наименьший элемент массива. Под удалением понимается создание нового двумерного массива без строки и столбца.

Пример.
4	3	1	=>	2	6
2	6	9		4	6
4	6	2
*/
