/*
Задачи из презентации к семинару.

Задача 1.
Задайте двумерный массив символов (тип char[,]). Создать строку из символов этого массива.

a	b	c	->	"abcdef"
d	e	f
*/

/////////////////////////////////////////////////////////////////

/*
Задача 2.
Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.

"aBcD1ef!-" -> "abcd1ef!-"
*/

/////////////////////////////////////////////////////////////////

/*
Задача 3.
Задайте произвольную строку. Выясните, является ли она палиндромом.

"aBcD1ef!-" -> Нет
"шалаш" -> Да
"55655" -> Да
*/

/////////////////////////////////////////////////////////////////

/*
Задача 4.
Задайте строку, состоящую из слов, разделенных пробелами. Сформировать строку, в которой слова расположены в обратном порядке. В полученной строке слова должны быть также разделены пробелами.

"Hello my world" -> "world my Hello"
*/
