/*
Задачи из презентации.

Задача 1
Задайте одномерный массив из 10 целых чисел от 1 до 100. Найдите количество элементов массива,
значения которых лежат в отрезке [20,90].

Пример
массив [10 21 14 93 23] => 2
*/





/*
Задача 2
Задайте массив на 10 целых чисел.
Напишите программу, которая определяет количество чётных чисел в массиве.

Пример
массив [6 7 19 34 3 1 4 7 9 1] => 3
массив [1 8 43 4 55 60 3 2 1 3] => 4
*/






/*
Задача 3
Задайте массив из вещественных чисел с ненулевой дробной частью. Найдите разницу между
максимальным и минимальным элементов массива.

Пример
массив [2.2 0.4 9.11 7.2 78.98] => 78.58
массив [1.22 4.5 3.33] => 3.28
*/

/*
Задача 4
Дано натуральное число в диапазоне от 1 до 100 000. Создайте массив, состоящий из цифр этого числа.
Старший разряд числа должен располагаться на 0-м индексе массива, младший – на последнем.
Размер массива должен быть равен количеству цифр.

Пример
425 => [4 2 5]
8741 => [8 7 4 1]
4 => [4]
*/

/*
