/*
Задача 1
Напишите программу, которая бесконечно запрашивает целые числа с консоли.
Программа завершается при вводе символа ‘q’ или при вводе числа, сумма цифр которого четная.

5 12 16 q [STOP]
3 45 342 15 [STOP]
*/

ФУНКЦИИИИИИИИИИИИИИИИИИИИИИ

//////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
Задача 2
Задайте массив заполненный случайными трёхзначными числами.
Напишите программу, которая покажет количество чётных чисел в массиве.

[344 452 341 125] => 2
*/

ФУНКЦИИИИИИИИИИИИИИИИИИИИИИ

//////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
Задача 3
Напишите программу, которая перевернёт одномерный массив (первый элемент станет последним, второй – предпоследним и т.д.)

[1 3 5 6 7 8] => [8 7 6 5 3 1]
*/

ФУНКЦИИИИИИИИИИИИИИИИИИИИИИ
